# 01. Import libraries

In [27]:
# import libraries
import pandas as pd
import numpy as np
import os

In [28]:
path = r'C:\Users\sjvai\Documents\07-23 Instacart Basket Analysis'

In [29]:
df_ord = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [30]:
df_prod = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', '4.3 products.csv'), index_col = False)

# 02. 4.5 Lesson

In [31]:
df_ord.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [32]:
# Create a dataframe
df_test = pd.DataFrame()

In [33]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [34]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [35]:
# Check for mixed types

for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

mix

In [36]:
df_test['mix'] = df_test['mix'].astype('str')

# Find missing values

In [37]:
df_prod.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [38]:
#Finding the missing values
df_nan = df_prod[df_prod['product_name'].isnull() == True]

In [39]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [40]:
df_prod.shape

(49693, 5)

In [41]:
df_prod_clean = df_prod[df_prod['product_name'].isnull() == False]

In [42]:
df_prod_clean.shape

(49677, 5)

# Duplicates

In [43]:
df_dups = df_prod_clean[df_prod_clean.duplicated()]

In [44]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [45]:
df_prod_clean_no_dups = df_prod_clean.drop_duplicates()

In [46]:
df_prod_clean_no_dups.shape

(49672, 5)

# 4.5 Task

In [47]:
df_ord.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Going off of the min and max values. I can tell that there isn't anything wrong and from a first glace there doesn't appear to be any mixed values.

In [48]:
#Step 3
#Check for mixed values in orders dataframe.
for col in df_ord.columns.tolist():
    weird = (df_ord[[col]].applymap(type) != df_ord[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ord[weird]) > 0:
        print(col)

In [49]:
#Answer for step 3 and 4.
#There are no mixed values which means there's nothing to fix.

In [50]:
#Step 5
#Run a check on missing values for orders dataframe.
df_ord.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [53]:
#Create a nan dataframe to check values
df_ord_nan = df_ord[df_ord['days_since_prior_order'].isnull() == True]

In [54]:
df_ord_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

Looking at the rows within this dataframe. It appears that all the missing values have the order number of 1. This makes sense as a users first order will have no orders from prior days.

Step 6: There is nothing to do here as all of the missing data is represented of a user making their first purchase with us.

In [55]:
#Step 7
#Run a dup check on the order dataframe
df_ord_dups = df_ord[df_ord.duplicated()]

In [56]:
df_ord_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

There are no duplicates within the order dataframe. As such there is nothing to address in this section

In [57]:
#Step 9a
#Export order dataframe into checked status
df_ord.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [58]:
#Step 9b
#Export product dataframe into checked status
df_prod_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))